Revit 2027 API
RebarFreeFormAccessor.HasValidMorphedServer Method
 Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidMorphedServer()
Public Function HasValidMorphedServer As Boolean
public:
bool HasValidMorphedServer()
member HasValidMorphedServer : unit -> bool
Return Value
Boolean
 Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace